import numpy as np

# 2018년 4월 서울 최고 기온(일별)
x = np.array([21.9, 24.5, 23.4, 26.2, 15.3, 22.4, 21.8, 16.8,
              19.9, 19.1, 21.9, 25.9, 20.9, 18.8, 22.1, 20.0,
              15.0, 16.0, 22.2, 26.4, 26.0, 28.3, 18.7, 21.3,
              22.5, 25.0, 22.0, 26.1, 25.6, 25.7])
# 2018년 4월 철원 최고 기온(일별)
y = np.array([8.3, 13.0, 8.4, 7.9, 7.0, 3.7, 6.1, 8.5, 8.6,
              11.9, 12.1, 14.4, 7.0, 10.5, 6.6, 10.6, 16.6,
              19.1, 20.1, 19.8, 24.5, 12.6, 16.4, 13.0, 13.3,
              14.1, 14.4, 17.0, 21.3, 24.5])


mx = x.sum() / len (x)
my = y.sum() / len (y)
sx = np.sqrt(((x - mx)**2).sum() / len (x))
sy = np.sqrt(((y - my)**2).sum() / len (y))
sxy = ((x - mx) * (y - my)).sum() / len (x)  # ❶
print("서울 최고 기온의 표준편차: {:.4f}".format(sx))
print("철원 최고 기온의 표준편차: {:.4f}".format(sy))
print("공분산: {:.4f}".format(sxy))
print("상관계수: {:.4f}".format(sxy / (sx * sy)))